In [1]:
import pandas as pd

In [2]:
l = [4,8,15,16,23,42]

In [3]:
sd=pd.Series(l)

In [4]:
print(sd)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
l1 = ['a','b','c','d','e']

In [9]:
sd=pd.Series(l1)

In [10]:
print(sd)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [13]:
df = pd.DataFrame({'Name': ['Alice','Bob','Claire'] ,
                            'Age': [25,30,27] , 
                            'Gender': ['Female','Male','Female']})

In [14]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
4 A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.
We can perform basic operations on rows/columns like selecting, deleting, adding, and renaming

In [ ]:
5 map() , apply() , applymap()

In [ ]:
6 data frame is mutable

In [15]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [18]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [ ]:
df[['Name' , 'Gender']]